<?php
/**
 * Created by PhpStorm.
 * User: vin
 * Date: 2018/7/19
 * Time: 下午2:32
 */

return [
    '000000' => '成功',

    // 参数验证
    '1' => [
        '100000' => '参数错误',
    ],

    // 用户验证
    '2' => [
        '200000' => '该用户不存在',
    ],

    // 身份验证
    '4' => [
        '400000' => '获取openid失败',
        '400001' => '不支持普惠通平台的Client_id',
        '400002' => 'redirect_uri域名与后台配置不一致',
        '400004' => '渠道key不存在',
        '400005' => '该渠道下的openid不正确',
        '400006' => '该openid不存在',

        // 异常
        '440001' => '获取用户openid异常',
        '440002' => '获取token异常',
        '440003' => '刷新token异常',
    ],

];